app/controllers/auth_controller.rb

INSERT INTO "users" ("email", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "quangpham.245@proton.me"], ["password_hash", "[FILTERED]"], ["created_at", "2022-11-29 15:01:53.579726"], ["updated_at", "2022-11-29 15:01:53.579726"]]
---
  def sign_up
    body = JSON.parse request.body.read

    password_hash =
      (body.key? 'password') ? (Digest::SHA256.hexdigest body['password']) : nil

    user = User.new(email: body['email'], password_hash: password_hash)

    if user.valid?
      user.save!

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@example.com"], ["LIMIT", 1]]
---
  def log_in
    body = JSON.parse request.body.read
    email = body['email']
    password = body['password']

    errors = Hash.new

    errors['email'] = ['email is required'] if email.blank?
    errors['password'] = ['password is required'] if password.blank?

    if not errors.empty?
      render status: :bad_request,
             json: {
               'message' =>
                 'the provided data is invalid, refer to `errors` for details',
               'errors' => errors,
             }
      return
    end

    user = User.find_by_email email